benchmark/config.yml
config:
  target: "" # No default target, depends on environment
  processor: "./benchmark.js"
  phases:
    - duration: 60
      arrivalRate: 2
      name: "Kargo warm up"
    - duration: 60
      arrivalRate: 3
      name: "Kargo sustained load"
  environments:
    public:
      variables:
        wms: "https://mapproxy.{{ $processEnvironment.SUBDOMAIN }}/service"
        wmst: "https://mapproxy.{{ $processEnvironment.SUBDOMAIN }}/wmts"
        wcs: "https://mapserver.{{ $processEnvironment.SUBDOMAIN }}//cgi-bin/ows"
        k2: "https://k2.{{ $processEnvironment.SUBDOMAIN }}"
        qs: "?"
    gravitee:
      variables:
        mapproxy: "https://apim.{{ $processEnvironment.SUBDOMAIN }}/mapproxy"
        mapserver: "https://apim.{{ $processEnvironment.SUBDOMAIN }}/mapserver"
        k2: "https://apim.{{ $processEnvironment.SUBDOMAIN }}/k2"
        qs: "?access_token={{ $processEnvironment.API_GATEWAY_JWT }}"
    express:
      variables:
        wms: "https://api.{{ $processEnvironment.SUBDOMAIN }}/wms"
        wmts: "https://api.{{ $processEnvironment.SUBDOMAIN }}/wmts"
        wcs: "https://api.{{ $processEnvironment.SUBDOMAIN }}/wcs"
        wfs: "https://api.{{ $processEnvironment.SUBDOMAIN }}/wfs"
        k2: "https://api.{{ $processEnvironment.SUBDOMAIN }}/k2"
        qs: "?jwt={{ $processEnvironment.API_GATEWAY_JWT }}"