benchmark/config.yml
config:
  target: "" # No default target, depends on environment
  processor: "./benchmark.js"
  phases:
    - duration: 60
      arrivalRate: 2
      name: "Kargo warm up"
    - duration: 60
      arrivalRate: 3
      name: "Kargo sustained load"
  environments:
    public:
      variables:
        wms: "https://mapcache.{{ $processEnvironment.SUBDOMAIN }}/service"
        wmst: "https://mapcache.{{ $processEnvironment.SUBDOMAIN }}/wmts"
        wcs: "https://mapserver.{{ $processEnvironment.SUBDOMAIN }}//cgi-bin/ows"
        k2: "https://k2.{{ $processEnvironment.SUBDOMAIN }}"
        qs: "?"
    api:
      variables:
        wms: "https://api.{{ $processEnvironment.SUBDOMAIN }}/wms"
        wmts: "https://api.{{ $processEnvironment.SUBDOMAIN }}/wmts"
        wcs: "https://api.{{ $processEnvironment.SUBDOMAIN }}/wcs"
        wfs: "https://api.{{ $processEnvironment.SUBDOMAIN }}/wfs"
        tms: "https://api.{{ $processEnvironment.SUBDOMAIN }}/tms"
        k2: "https://api.{{ $processEnvironment.SUBDOMAIN }}/k2"
        qs: "?jwt={{ $processEnvironment.API_GATEWAY_JWT }}"